app/views/case_images/_form.html.slim

SELECT `case_images`.* FROM `case_images` WHERE `case_images`.`id` = 4 LIMIT 1
---
  = render 'shared/error_messages', :taget => @case_image
  - if @case_image.image.present?