app/views/case_studies/show.html.slim


  - @case_study.case_images.each do |image|
    .grid-9.alpha.omega.top-margin
---
SELECT `case_images`.* FROM `case_images` WHERE `case_images`.`case_study_id` = 1