app/controllers/case_studies_controller.rb

SELECT COUNT(*) FROM `case_studies`
---
    def index
      session[:go_to_after_edit] = case_studies_path
      @case_studies = CaseStudy.order('sorting desc').page(params[:page]).per(8)

INSERT INTO `case_studies` (`body`, `client`, `created_at`, `crop_params`, `image`, `order`, `task`, `title`, `updated_at`, `year`) VALUES (NULL, NULL, '2011-12-10 20:44:37', '--- {}\n\n', 'cosesy_logo.png', NULL, NULL, NULL, '2011-12-10 20:44:37', NULL)
---
    def create
      @case_study = CaseStudy.new(params[:case_study])
      if @case_study.save

SELECT `case_studies`.* FROM `case_studies` WHERE `case_studies`.`id` = 2 LIMIT 1
UPDATE `case_studies` SET `updated_at` = '2011-12-09 22:36:35', `crop_params` = '--- \n:large: \n :crop_x: 140\n :crop_y: 247\n :crop_w: 735\n :crop_h: 515\n' WHERE `case_studies`.`id` = 2
---
    def crop_update
    #  @case_study = current_case_study                        #!!! current case_study? no no no
      @case_study = CaseStudy.find(params[:id])
      @case_study.crop_x = params[:case_study]["crop_x"]
      @case_study.crop_y = params[:case_study]["crop_y"]
      @case_study.crop_h = params[:case_study]["crop_h"]
      @case_study.crop_w = params[:case_study]["crop_w"]
      @case_study.crop_version = params[:case_study]["crop_version"]
      @case_study.save