app/controllers/gallery_images_controller.rb

  def index
    #@gallery_images = GalleryImage.order('sorting asc').offset(1).limit(10)
    @gallery_images = GalleryImage.order('sorting asc')
---
SELECT `gallery_images`.* FROM `gallery_images` ORDER BY sorting asc

  def create
    @gallery_image = GalleryImage.new(params[:gallery_image])
    if @gallery_image.save
---
INSERT INTO `gallery_images` (`body`, `created_at`, `crop_params`, `image`, `sorting`, `title`, `updated_at`) VALUES ('oplæg udviklet til Krebs og Ko', '2011-12-10 10:51:38', '--- {}\n\n', 'Lokalenergi_forside.jpg', 100, 'Lokal energi', '2011-12-10 10:51:38')

  def crop_update
  #  @gallery_image = current_gallery_image                        #!!! current gallery_image? no no no
    @gallery_image = GalleryImage.find(params[:id])
    @gallery_image.crop_x = params[:gallery_image]["crop_x"]
    @gallery_image.crop_y = params[:gallery_image]["crop_y"]
    @gallery_image.crop_h = params[:gallery_image]["crop_h"]
    @gallery_image.crop_w = params[:gallery_image]["crop_w"]
    @gallery_image.crop_version = params[:gallery_image]["crop_version"]
    @gallery_image.save
---
SELECT `gallery_images`.* FROM `gallery_images` WHERE `gallery_images`.`id` = 2 LIMIT 1
UPDATE `gallery_images` SET `updated_at` = '2011-12-07 21:33:36', `crop_params` = '--- \n:large: \n :crop_x: 264\n :crop_y: 0\n :crop_w: 200\n :crop_h: 223\n' WHERE `gallery_images`.`id` = 2