app/controllers/home_controller.rb

SELECT `gallery_images`.* FROM `gallery_images` ORDER BY sorting asc LIMIT 3
---
  def index
    @menu = 'home'
    session[:go_to_after_edit] = root_path
    @welcome = TextContent.welcome
    @images = GalleryImage.order('sorting asc').limit(3)