app/controllers/team_controller.rb

SELECT `users`.* FROM `users` ORDER BY name asc
---
  def index
    session[:go_to_after_edit] = users_path
    @users = User.order('name asc')