app/controllers/text_contents_controller.rb

SELECT COUNT(*) FROM `text_contents`
SELECT `text_contents`.* FROM `text_contents` ORDER BY title asc LIMIT 25 OFFSET 0
---
  def index
    @menu = 'admin'
    session[:go_to_after_edit] = text_contents_path
    @text_contents = TextContent.search(params[:search]).order(sort_column + " " + sort_direction).page(params[:page]).per(25)