app/controllers/users_controller.rb

  def index
    # def index
    #   @products = Product.order(params[:sort])
    # end

    @users = User.order(sort_column + " " + sort_direction).paginate(:per_page => 30, :page => params[:page])
---
SELECT `users`.* FROM `users` ORDER BY name asc LIMIT 25 OFFSET 0

  def update

    @user = User.find(params[:id])
    @user.update_attributes(params[:user])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1 OFFSET 0
UPDATE `users` SET `title` = 'Graphic designer', `body` = 'Maria is expert in photoshoop and illustrator', `phone` = '', `updated_at` = '2011-12-10 16:40:58', `crop_params` = '--- \n:large: \n :crop_x: 0\n :crop_y: 4\n :crop_w: 358\n :crop_h: 400\n' WHERE `users`.`id` = 2

  def create
    @user = User.new(params[:user])
    @user.image_content_type = MIME::Types.type_for(@user.image.original_filename).first.to_s if @user.image.original_filename.present?
    @user.save
---
INSERT INTO `users` (`created_at`, `crop_params`, `current_sign_in_at`, `current_sign_in_ip`, `email`, `encrypted_password`, `grid`, `image`, `last_sign_in_at`, `last_sign_in_ip`, `name`, `remember_created_at`, `reset_password_sent_at`, `reset_password_token`, `role`, `sign_in_count`, `updated_at`) VALUES ('2011-12-08 10:57:11', '--- {}\n\n', NULL, NULL, 'maria@liquidmind.dk', '$2a$10$wRCgbNpdVT0rFeAJ2x0mbOClG/JN8BCMeLt.DrQ0E0iQwmQ6Yd4Sy', 0, '2_Beta_frontpage.jpg', NULL, NULL, 'Maria', NULL, NULL, NULL, 'super', NULL, '2011-12-08 10:57:11')