app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1 OFFSET 0
UPDATE `users` SET `updated_at` = '2011-12-07 21:02:56', `crop_params` = '--- \n:large: \n :crop_x: 158\n :crop_y: 5\n :crop_w: 176\n :crop_h: 197\n' WHERE `users`.`id` = 1
---
  def crop_update
  #  @user = current_user                        #!!! current user? no no no
    @user = User.find(params[:id])
    @user.crop_x = params[:user]["crop_x"]
    @user.crop_y = params[:user]["crop_y"]
    @user.crop_h = params[:user]["crop_h"]
    @user.crop_w = params[:user]["crop_w"]
    @user.crop_version = params[:user]["crop_version"]
    @user.save